ИСПП/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЕдиницы</name>
    <type>
      <types>EnumRef.ТипыЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКЕИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоитИзДругихУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПотребительскойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИСПП/src/Enums/ТипыЕдиницИзмерения/ТипыЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЕдиницИзмерения</name>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>Вес</name>
  </enumValues>
  <enumValues>
    <name>Объем</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>Площадь</name>
  </enumValues>
  <enumValues>
    <name>КоличествоШтук</name>
  </enumValues>
  <enumValues>
    <name>Концентрация</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницаДействия</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Catalogs/ЕдиницыИзмерения/Forms/ФормаВыбора/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаПодобратьИзКлассификатора.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ЕдиницыИзмерения);
	
	НастроитьСписокВыбора();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.ЕдиницыИзмерения.Форма.КлассификаторЕдиницИзмерения",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьСписокВыбора()
	
	Если Параметры.Свойство("ВыборБазовыхЕдиницИзмеренияПрепаратов") Тогда
		
		Отбор = ОбщегоНазначенияПоддержкаПроектовКлиентСервер.ОбластьОтбораДинамическогоСписка(Список);
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор.Элементы, "ЕдиницыПрепаратов", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ТипыЕдиницИзмерения = Новый Массив;
		ТипыЕдиницИзмерения.Добавить(Перечисления.ТипыЕдиницИзмерения.Вес);
		ТипыЕдиницИзмерения.Добавить(Перечисления.ТипыЕдиницИзмерения.Объем);
		Единицы = Новый Массив;
		Единицы.Добавить(ЗначениеНастроекПоддержкаПроектовПовтИсп.ПолучитьЕдиницуИзмеренияШтук());
		Единицы.Добавить(ЗначениеНастроекПоддержкаПроектовПовтИсп.ПолучитьЕдиницуИзмеренияДоз());
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ТипЕдиницы", ТипыЕдиницИзмерения, ВидСравненияКомпоновкиДанных.ВСписке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "Ссылка", Единицы, ВидСравненияКомпоновкиДанных.ВСписке);
		
	Иначе
		
		Если Не Параметры.Отбор.Свойство("ТипЕдиницы") Тогда
			
			ОтборПоТипу = Новый Массив;
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.Вес);
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.Объем);
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.Площадь);
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.Длина);
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.КоличествоШтук);
			ОтборПоТипу.Добавить(Перечисления.ТипыЕдиницИзмерения.ПустаяСсылка());
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипЕдиницы", ОтборПоТипу, ВидСравненияКомпоновкиДанных.ВСписке);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
